Repository: Setsu548/app_texi_front_fltr_driver
Catalog: lib/l10n/arb/l10n_*.arb
Languages: es

# labelLaborCategory
source: Labor category
es: Categoría laboral

# labelInitialAdvisor
source: Initial advisor
es: Asesor inicial

# commonCancel
source: Cancel trip
es: Cancelar Viaje

# labelFastestSafestTravel
source: Driver platform
es: Plataforma para conductores

# primaryVariantButtonSignIn
source: Sign In
es: Iniciar Sesión

# linkTextPrimaryRegister
source: Sign Up
es: Registrarse

# labelTextCurrentStatus
source: Current status
es: Estado actual

# bodyTextActive
source: Active
es: Activo

# bodyTextTrajectory
source: Your journey with TEXI
es: Tu trayectoria junto a TEXI

# labelTextTripsAttended
source: In attended trips
es: En viajes atendidos

# labelTextCompletedTrips
source: Completed trips:
es: Viajes completados:

# titleTextTravelRequests
source: Travel requests
es: Solicitudes de viaje

# labelTextSelectRequest
source: Select a request to accept
es: Selecciona una solicitud para aceptar

# labelTextPickup
source: Pickup
es: Recogida

# labelTextDestination
source: Destination
es: Destino

# labelTextDetail
source: Detail
es: Detalle

# labelTextDistance
source: Distance
es: Distancia

# labelTextEstimatedTime
source: Estimated time
es: Tiempo estimado

# labelTextEarnings
source: Earnings
es: Ganancias

# commonAccept
source: Accept
es: Aceptar

# titleTextTravelDetails
source: Trip Details
es: Detalles del Viaje

# labelTextInProgress
source: In progress
es: En progreso

# bodyTextTravelInfo
source: Trip information
es: Información del viaje

# labelTextPaymentMethod
source: Payment method
es: Método de pago

# labelTextServiceType
source: Service type
es: Tipo de servicio

# primaryVariantButtonAcceptTrip
source: Accept Trip
es: Aceptar Viaje

# secondaryVariantButtonBack
source: Back
es: Regresar

# labelTextTime
source: Time
es: Tiempo

# labelTextTariff
source: Tariff
es: Tarifa

# primaryVariantButtonHowToGet
source: How to get there
es: Cómo llegar

# infoTileFlatPickupPoint
source: Pickup point
es: Punto de recogida

# labelTextWaitingTime
source: Waiting time
es: Tiempo de espera

# primaryVariantButtonIArrived
source: I have arrived
es: He llegado

# secondaryVariantButtonMessage
source: Message
es: Mensaje

# primaryVariantButtonStartTrip
source: Start trip
es: Iniciar viaje

# primaryVariantButtonEndTrip
source: End trip
es: Finalizar viaje

# titleTextTripRatingQuestion
source: How was your trip with
es: Cómo fue tu viaje con

# labelTextAdditionalComments
source: Additional comments (optional)
es: Comentarios adicionales (opcional)

# textFieldHintTellMore
source: Tell us more about your passenger...
es: Cuéntanos más sobre tu pasajero...

# primaryButtonSendRating
source: Submit rating
es: Enviar calificación

# linkTextSecondarySkipForNow
source: Skip for now
es: Omitir por ahora

# titleTextActivateTexi
source: Activate TEXI
es: Activar TEXI

# titleTextFacialIdentification
source: Facial Identification
es: Identificación Facial

# bodyTextFaceInstruction
source: Please place your face in front of the camera to verify your identity and start receiving trips
es: Por favor, coloca tu rostro frente a la cámara para verificar tu identidad y comienza a recibir viajes

# labelTextWellLitPlaceWarning
source: Make sure you are in a well-lit place, without additional items (hat, glasses, scarf...)
es: Asegúrate de estar en un lugar bien iluminado, sin prendas adicionales (gorra, anteojos, bufanda...)

# primaryVariantButtonStartScan
source: Start Scan
es: Iniciar Escaneo

# labelTextBiometricInfoProtection
source: Your biometric information is protected and only used to verify your identity
es: Tu información biométrica está protegida y solo se usa para verificar tu identidad

# titleTextTexiRegister
source: TEXI REGISTRATION
es: TEXI REGISTRO

# titleTextWelcomeDriver
source: Welcome Driver!
es: ¡Bienvenido Conductor!

# bodyTextWelcomeMessage
source: We are excited to have you join our platform. To start working, we need some important information.
es: Estamos emocionados de que te unas a nuestra plataforma. Para comenzar a trabajar, necesitamos algunos datos importantes.

# labelTextCompleteDataInfo
source: It is important to complete all data correctly to ensure a quick and smooth verification
es: Es importante completar todos los datos correctamente para garantizar una verificación rápida y sin problemas

# primaryVariantButtonStartRegistration
source: Start Registration
es: Comenzar Registro

# labelTextTermsAndConditions
source: By registering, you accept our terms and conditions of service
es: Al registrarte, aceptas nuestros términos y condiciones de servicio

# secondaryVariantButtonCancel
source: Cancel
es: Cancelar

# titleTextPersonalInfo
source: Personal Information
es: Información Personal

# labelTextEnterPersonalData
source: Please enter your personal data
es: Por favor ingresa tus datos personales

# labeledTextFieldFirstName
source: First Name*
es: Nombres*

# labeledTextFieldFirstNameHint
source: E.g. Juan Diego
es: Ej. Juan Diego

# labeledTextFieldLastName
source: Last Name*
es: Apellidos*

# labeledTextFieldLastNameHint
source: E.g. Dias Soto
es: Ej. Dias Soto

# labeledTextFieldPhoneNumber
source: Phone Number*
es: Número de Teléfono*

# labeledTextFieldAddress
source: Address*
es: Dirección*

# labeledTextFieldAddressHint
source: Street, number, neighborhood
es: Calle, número, barrio

# labeledDropdownDepartment
source: Department*
es: Departamento*

# labeledDropdownDepartmentHint
source: Select your department
es: Selecciona tu departamento

# labeledDropdownProvince
source: Province*
es: Provincia*

# labeledDropdownProvinceHint
source: Select your province
es: Selecciona tu provincia

# labeledTextFieldEmail
source: Email*
es: Correo Electrónico*

# labeledTextFieldEmailHint
source: example@email.com
es: ejemplo@correo.com

# primaryVariantButtonContinue
source: Continue
es: Continuar

# titleTextIdentityVerification
source: Identity Verification
es: Verificación de Identidad

# labelTextIdentityInstruction
source: Please enter your identification number and upload the required images to verify your identity
es: Por favor ingrese su número de identificación y suba las imágenes requeridas para verificar su identidad

# labeledTextFieldIdNumber
source: Identification Number*
es: Número de Identificación*

# labeledTextFieldIdNumberHint
source: Enter your identification number
es: Ingrese su número de identificación

# labelTextIdNumberInfo
source: Enter the number shown on your identity document
es: Ingrese su número que aparece en su documento de identidad

# bodyTextIdPhoto
source: Identity Document Photo
es: Foto del Documento de Identidad

# photoCaptureFrontDocumentTitle
source: Front side of the document
es: Parte frontal del documento

# photoCaptureFrontDocumentDescription
source: Make sure all information is visible
es: Asegúrese de que toda la información sea visible

# photoCaptureBackDocumentTitle
source: Back side of the document
es: Parte trasera del documento

# photoCaptureBackDocumentDescription
source: Make sure all information is visible
es: Asegúrese de que toda la información sea visible

# photoCaptureProfileTitle
source: Profile photo
es: Foto para su perfil

# photoCaptureProfileDescription
source: Take a clear photo of your face
es: Tome una foto clara de tu rostro

# photoCaptureProfileButton
source: Take Photo
es: Tomar Foto

# secondaryVariantButtonContinueLater
source: Continue Later
es: Continuar Después

# titleTextDriverLicenseVerification
source: Driver License Verification
es: Verificación de Licencia

# labelTextDriverLicenseInstruction
source: Please upload images of your document to verify your license
es: Por favor sube las imágenes de tu documento para verificar tu licencia

# labeledDropdownLicenseCategory
source: License Category
es: Categoría de Licencia

# labeledDropdownLicenseCategoryHint
source: Select category
es: Seleccionar categoría

# bodyTextDriverLicensePhoto
source: Driver License Photo
es: Foto de Licencia de Conducir

# photoOptionsFrontTitle
source: Front Side
es: Lado Frontal

# photoOptionsFrontButtonTake
source: Upload Photo
es: Subir foto

# photoOptionsFrontButtonUpload
source: Use Camera
es: Usar camara

# photoOptionsBackTitle
source: Back Side
es: Lado Posterior

# titleTextRegistrationConfirmation
source: Registration Data!
es: ¡Datos del registro!

# labelTextVerifyData
source: Please verify that the data to be sent for review is correct
es: Por favor verifique que los datos que se enviarán a su revisión son los correctos

# bodyTextInformationSummary
source: Information Summary
es: Resumen de información

# bodyTextPersonalInformation
source: Personal Information
es: Información Personal

# linkTextEdit
source: Edit
es: Editar

# bodyTextName
source: Name:
es: Nombre:

# bodyTextCI
source: ID:
es: CI:

# bodyTextPhone
source: Phone:
es: Teléfono:

# bodyTextLicenseCategory
source: Category:
es: Categoría:

# primaryVariantButtonSubmitRequest
source: Submit Request
es: Enviar Solicitud

# bodyTextAllDataSubmitted
source: All data has been submitted for verification. You will receive a message with confirmation and the next steps to follow
es: Todos los datos han sido enviados para ser verificados. Recibirás un mensaje con la confirmación y los próximos pasos a seguir

# titleTextVehicleSelection
source: Vehicle Selection
es: Selección de Vehículo

# bodyTextVehicleInstruction
source: Please select one of the following options to continue the registration process
es: Por favor selecciona una de las siguientes opciones para continuar con el proceso de registro

# primaryVariantButtonRegisterNewVehicle
source: Register New Vehicle
es: Registrar vehículo nuevo

# primaryVariantButtonSelectRegisteredVehicle
source: Select Registered Vehicle
es: Seleccionar Vehículo Registrado

# bodyTextRegisteredVehicleInfo
source: If you have previously registered a vehicle, you can select it from the list of registered vehicles. Otherwise, register a new vehicle to get started
es: Si ya ha registrado un vehículo anteriormente puede seleccionarlo de la lista de vehículos registrados. De lo contrario, registre un nuevo vehículo para comenzar

# titleTextVehicleInfo
source: Vehicle Information
es: Información del Vehículo

# labelTextEnterVehicleData
source: Please enter your vehicle details to complete your TEXI driver registration.
es: Por favor ingresa los detalles de tu vehículo para completar tu registro como conductor TEXI.

# labeledDropdownVehicleBrand
source: Vehicle Brand*
es: Marca del Vehículo*

# labeledDropdownVehicleBrandHint
source: Select a brand
es: Selecciona una marca

# labeledTextFieldVehicleModel
source: Model*
es: Modelo*

# labeledTextFieldVehicleModelHint
source: Ex. Corolla, Civic, Sentra
es: Ej. Corolla, Civic, Sentra

# labeledDropdownVehicleYear
source: Year*
es: Año*

# labeledDropdownVehicleYearHint
source: Select the year
es: Selecciona el año

# labeledTextFieldVehiclePlate
source: License Plate Number
es: Número de Placa

# labeledTextFieldVehiclePlateHint
source: Ex. ABC-123
es: Ej. ABC-123

# radioGroupVehicleType
source: Vehicle Type
es: Tipo de Vehículo

# bodyTextVehicleOwnership
source: Vehicle Ownership Document
es: Tarjeta de Propiedad del Vehículo

# photoOptionsVehicleDocumentTitle
source: Ownership Document
es: Documento de propiedad

# photoOptionsVehicleDocumentButtonTake
source: Upload photo
es: Subir foto

# photoOptionsVehicleDocumentButtonUpload
source: Use camera
es: Usar cámara

# labelTextConfirmVehicleData
source: I confirm that the information provided is correct
es: Confirmo que la información proporcionada es correcta

# bodyTextVehicleInfoNotice
source: Make sure that the entered data matches the official vehicle documents to avoid issues during verification
es: Asegúrese de que los datos ingresados coincidan con los documentos oficiales del vehículo para evitar problemas durante la verificación

# titleTextVehiclePhotos
source: Vehicle Photos
es: Fotografías del Vehículo

# labelTextVehiclePhotosInstruction
source: To complete the registration, we need clear photos of all four sides of your vehicle
es: Para completar el registro, necesitamos fotos claras de los cuatro lados de su vehículo

# cardPrimaryContainerVehiclePhotosInfo
source: Make sure to take photos in good lighting and that the entire vehicle is clearly visible in each shot.
es: Asegúrese de tomar las fotos con buena iluminación y que se vea claramente todo el vehículo en cada toma.

# bodyTextFront
source: 1. Front of the vehicle
es: 1. Frente del vehículo

# bodyTextLeftSide
source: 2. Left side
es: 2. Lateral izquierdo

# bodyTextRightSide
source: 3. Right side
es: 3. Lateral derecho

# bodyTextBack
source: 4. Rear
es: 4. Parte trasera

# photoPickerTapLabel
source: Tap to take photo
es: Toque para tomar la foto

# titleTextRegistrationConfirmationVehicle
source: Registration Data
es: ¡Datos del registro!

# labelTextVerifyVehicleData
source: Please verify that the data to be submitted for review is correct
es: Por favor verifique que los datos que se enviarán a su revisión son los correctos

# bodyTextVehicleInformation
source: Vehicle Information
es: Información del Vehículo

# labelVehicleBrand
source: Brand:
es: Marca:

# labelVehicleModel
source: Model:
es: Modelo:

# labelVehicleYear
source: Year:
es: Año:

# labelVehiclePlate
source: Plate:
es: Placa:

# labelVehicleCategory
source: Category:
es: Categoría:

# bodyTextDocuments
source: Documents
es: Documentos

# labelVehicleRegistrationCard
source: Registration Card
es: Tarjeta de Circulación

# labelVehiclePhoto
source: Vehicle Photo
es: Foto del Vehículo

# labelVehicleInsurance
source: Mandatory Insurance
es: Seguro Obligatorio

# labelTextAllDataSent
source: All data has been submitted for verification. You will receive a message with confirmation and the next steps to follow.
es: Todos los datos han sido enviados para ser verificados. Recibirás un mensaje con la confirmación y los próximos pasos a seguir.

# titleTextVehicleVerification
source: Vehicle Verification
es: Verificación de Vehículo

# bodyTextVehiclePlateInstruction
source: Enter the vehicle license plate to check if it is registered in our system and link it as a driver.
es: Ingrese la placa del vehículo para verificar si está registrado en nuestro sistema y vincularlo como conductor.

# labelTextVehiclePlateInfo
source: The license plate must be entered without spaces or special characters (e.g., ABC123).
es: La placa debe ingresarse sin espacios ni caracteres especiales (ejemplo: ABC123).

# hintTextVehiclePlate
source: Enter the plate here
es: Ingrese la placa aquí

# primaryVariantButtonVerifyVehicle
source: Verify Vehicle
es: Verificar Vehículo

# linkTextRegisterNewVehicle
source: Don't have a registered vehicle? Register a new one
es: ¿No tienes un vehículo registrado? registre uno nuevo

# titleTextVehicleFound
source: Vehicle Found!
es: ¡Vehículo encontrado!

# bodyTextVehicleFoundInstruction
source: Your request will be reviewed by our team within the next 24 hours.
es: Su petición será revisada por nuestro equipo en las próximas 24 horas.

# bodyTextVehicleDetails
source: Vehicle Details
es: Detalles del vehículo

# labelTextVehiclePlate
source: Plate:
es: Placa:

# labelTextVehicleModel
source: Model:
es: Modelo:

# labelTextVehicleYear
source: Year:
es: Año:

# bodyTextVehicleNotificationInfo
source: You will receive a notification when your request has been verified and approved.
es: Recibirá una notificación cuando su solicitud haya sido verificada y aprobada.

# primaryVariantButtonBackHome
source: Back to Home
es: Volver al inicio

# secondaryVariantButtonCheckStatus
source: Check Status
es: Revisar estado

# titleTextVehicleNotFound
source: Vehicle Not Found
es: Vehículo no encontrado

# bodyTextVehicleNotFoundInstruction
source: The entered license plate is not registered in our system. Please verify the details or register the vehicle as new.
es: La placa ingresada no está registrada en nuestro sistema. Por favor verifique los datos o registre el vehículo como nuevo.

# labelTextVehicleNotFoundInfo
source: If you are sure the plate is correct, you may need to register this vehicle in the system first.
es: Si está seguro que la placa es correcta, es posible que necesite registrar este vehículo en el sistema primero.

# primaryVariantButtonRetry
source: Try Again
es: Volver a intentar

# secondaryVariantButtonBackHome
source: Back to Home
es: Regresar al inicio

# bodyTextNeedRegisterVehicle
source: Need to register a new vehicle?
es: ¿Necesita registrar un vehículo nuevo?

# labelTextRegisterVehicleInfo
source: If the vehicle is not in our system, you can easily register it.
es: Si el vehículo no está en nuestro sistema, puede registrarlo fácilmente.
